import './style.css'

// // Задача 10: Запросите у пользователя целое число и выведите ответ, четное число или нет. В задании
// // используйте логические операторы. В задании не надо использовать if или swich.

// alert(`Задача 10: Запросите у пользователя целое число и выведите ответ, четное число или нет. В задании
// используйте логические операторы. В задании не надо использовать if или swich.`);
// var a = prompt('Введите число для проверки на четность: ');
// a = Number(a);
// alert((parseInt(a) % 2 == 0) ? "ЧЁТНОЕ" : "НЕЧЁТНОЕ");






// // Задача 9: Запросите у пользователя трехзначное число и выведите его задом наперед. Для решения
// // задачи вам понадобится оператор % (остаток от деления).

// alert(
//   "Задача 9: Запросите у пользователя трехзначное число и выведите его задом наперед. Для решения задачи вам понадобится оператор % (остаток от деления)"
// );
// nmb = prompt('Введите трехзначное число: ');
// var a = Number(nmb % 10);
// var b = Number((nmb - a) / 10 % 10);
// var c = Number((nmb - a - b * 10) / 100);
// alert('Перевертыш: ' + (a * 100 + b * 10 + c));





// // Задача 8: Пользователь вводит сумму денег в кошельке и цену одной шоколадки. Программа выводит, сколько
// // шоколадок может купить пользователь и сколько сдачи у него останется.

// alert(`Задача 8: Пользователь вводит сумму денег в кошельке и цену одной шоколадки. Программа выводит, сколько шоколадок может купить пользователь и сколько сдачи у него останется.`);
// var sum = prompt("Cколько у вас в бумажнике денег? ");
// var price = prompt("И почем одна шоколадка? ");
// sum = Number(sum);
// price = Number(price);
// var sell = Math.trunc(sum / price);
// var change = sum -price * sell;
// if (sell < 1) {
//   alert('Сегодня вы на нуле. приходите в другой раз');
// }
// else {
//   alert('Получите свои ' + sell + ' шоколадки, а также сдачу ' + (sum - price * sell) + ' рублей ');
// }





// Задача 7: Пользователь указывает объем флешки в Гб. Программа должна посчитать,
//сколько файлов размеров в 820 Мб помещается на флешку.

// alert('Задача 7: Пользователь указывает объем флешки в Гб.Программа должна посчитать, сколько файлов размеров в 820 Мб помещается на флешку.');
// const GB_MB = 1024;
// var flash_drive = Number(prompt('Каков объем вашей флешки в Гб? '));
// var size = Math.trunc(flash_drive * 1000 / GB_MB);
// if (size < 0) {
//   alert('Ваша флешка перезаполнена, освободите пространство');
// }
// else {
//   alert('На флешку поместится ' + size + ' файлов объемом 820 Мб');
// }




// Задача 6: Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро.
// Курс валют храните в константе.

// alert('Задача 6: Реализуйте конвертор валют. Пользователь вводит доллары, программа переводит в евро. Курс валют храните в константе.');
// const rate = Number(prompt('Введите текущий курс доллара по отношению к евро: '));
// var dollar = Number(prompt('Введите количество долларов для обмена: '));
// alert("По текущему курсу при обмене вы получите " + dollar * rate + " евро");




// Задача 5: Запросите у пользователя расстояние в км между двумя городами и за сколько часов
// он хочет добраться. Посчитайте скорость, чтобы успеть вовремя.

// alert(`Задача 5: Запросите у пользователя расстояние в км между двумя городами и за сколько часов он хочет добраться. Посчитайте скорость, чтобы успеть вовремя.`);
// var distance = Number(prompt("Введите расстояние между городами в км: "));
// var time = Number(prompt('За какое время вы хотите преодолеть это расстояние в часах? '));
// alert('Вам необходимо двигаться со средней скоростью ' + distance / time + ' км/ч');





// Задача 4: Запросите у пользователя радиус окружности и выведите площадь такой окружности.

// alert('Задача 4: Запросите у пользователя радиус окружности и выведите площадь такой окружности.');
// var radius = Number(prompt('Введите радиус окружности: '));
// var square = Math.PI * radius ** 2;
// alert('Площадь окружности: '+ square);


// Задача 3: Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата.

// alert('Задача 3: Запросите у пользователя длину стороны квадрата и выведите периметр такого квадрата.');
// side_lengh = Number(prompt('Введите длину стороны квадрата: '));
// alert('Периметр квадрата равен: ' + 4 * side_lengh);





// Задача 2: Запросите у пользователя год его рождения, посчитайте, сколько ему лет и выведите результат.
// Текущий год укажите в коде как константу.

// alert(
//     `Задача 2: Запросите у пользователя год его рождения, посчитайте, сколько ему лет и выведите результат.Текущий год укажите в коде как константу.`
//   );
//   var year_of_birth = Number(prompt('В каком году вы родились? '));
//   const this_year = Number(prompt('Какой сейчас год? '));
//   alert('В текущем году вам стукнет ' + (this_year - year_of_birth) + ' лет');
  




// Задание 1: Запросите у пользвателя его имя и выведите в ответ: "Привет, его имя!"

// name = prompt('Как вас зовут? ');
// alert('Привет, ' + name + '!');




// Задание 1: Написать функцию возведения числа в степень, используя рекурсию.

// function Task1() {
//     function Exponentiation(a, b) {
//       if (b == 1) {
//         return a;
//       } else {
//         return a * Exponentiation(a, b - 1);
//       }
//     }
//     alert(
//       "Задание 1: Написать функцию возведения числа в степень, используя рекурсию."
//     );
  
//     let x = 0;
//     let y = 0;
//     do {
//       x = +prompt("Введите число, которое будем возводить в степень ");
//       y = Math.trunc(+prompt("Введите степень, в которую надо возвести число "));
//     } while (y < 1);
//     alert(Exponentiation(x, y));
//   }
//   Task1();
  



// Задание 3: Написать функцию для поиска максимальной цифры в числе, использую рекурсию.

// function Task3() {
//     function MaxDigitNumber(a, maxDigit) {
//       if (a == 0) {
//         return maxDigit;
//       } else {
//         if (maxDigit < a % 10) {
//           maxDigit = a % 10;
//         }
//         return Math.trunc(MaxDigitNumber(a / 10, maxDigit));
//       }
//     }
  
//     alert(
//       "Задание 3: Написать функцию для поиска максимальной цифры в числе, использую рекурсию."
//     );
//     let y = 0;
//     let x = Math.trunc(Math.abs(+prompt("Введите число: ")));
//     alert("Наибольшая цифра в данном числе " + MaxDigitNumber(x, y));
//   }
//   Task3();
  




// Задание 4: Написать функцию, которая определяет, простое ли переданное число. Использовать рекурсию.

// function Task4() {
//     function PrimeNumber(a, b) {
//       if (a % b == 0 && b >= 2) {
//         return alert("Данное число не является простым.");
//       } else {
//         if (b == 1) {
//           return alert("Да, это простое число.");
//         }
//         return PrimeNumber(a, b - 1);
//       }
//     }
//     alert(
//       "Задание 4: Написать функцию, которая определяет, простое ли переданное число. Использовать рекурсию."
//     );
  
//     let x = 2;
  
//     do {
//       x = Math.trunc(Math.abs(+prompt("Введите натуральное число больше 2: ")));
//     } while (x <= 2);
//     let y = x - 1;
//     PrimeNumber(x, y);
//   }
//   Task4();




// Задание 5: Написать функцию, для вывода всех множителей переданного числа в возрастающем порядке.
// Например: число 18 - множители 2 * 3 * 3.

// function Task5() {
//     function Multiplier(a, b, c) {
//       if (b > a ** 0.5) {
//         c.push(a);
//         return c;
//       } else if (a % b == 0) {
//         c.push(b);
//         Multiplier(a / b, b, c);
//       } else {
//         Multiplier(a, b + 1, c);
//       }
//       return c.join("*");
//     }
//     alert(
//       "Задание 5: Написать функцию, для вывода всех множителей переданного числа в возрастающем порядке. Например: число 18 - множители 2 * 3 * 3."
//     );
//     let x = Math.trunc(+prompt("Введите число: "));
//     let y = 2;
//     let z = [];
  
//     alert(Multiplier(x, y, z));
//   }
//   Task5();
  





  // Задание 6: Написать функцию рекурсии, которая возвращает число Фибоначи по переданному порядковому номеру.
  // Числа Фибоначчи: 1, 1, 2, 3, 5, 8, 13... Ряд основывается на том, что кажое число равно сумме двух
  // предыдущих чисел. Например: порядковый номер 3 - число 2, порядковый номер 6 - число 8.
  
//   function Task6() {
//     function Fibonacci(a) {
//       if (a == 1 || a == 2) {
//         return 1;
//       }
//       return Fibonacci(a - 1) + Fibonacci(a - 2);
//     }
  
//     alert(
//       "Задание 6: Написать функцию рекурсии, которая возвращает число Фибоначи по переданному порядковому номеру. Числа Фибоначчи: 1, 1, 2, 3, 5, 8, 13... Ряд основывается на том, что кажое число равно сумме двух предыдущих чисел. Например: порядковый номер 3 - число 2, порядковый номер 6 - число 8."
//     );
  
//     do {
//       x = Math.trunc(
//         +prompt("Введите порядковый номер числа из ряда Фибоначчи: ")
//       );
//     } while (x < 1);
  
//     alert(Fibonacci(x));
//   }
//   Task6();

//let company = prompt('Какое "официальное" название JavaScript?', '');

//if (company == 'ECMAScript') {
 // alert( 'Да вы знаток!' )
//} else {
 // alert( 'Не знаете? “ECMAScript”!' )



 //let chisl = prompt('Введите число', 0);

//if (chisl > 0) {
//  alert( 1 );
//} else if (chisl < 0) {
 // alert( -1 );
////} else {
  //alert( 0 );
//}

/*let age = 14
if (age >= 14 && age <= 90 ) {
  console.log(true)
}

//Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.

//Напишите два варианта: первый с использованием оператора НЕ !, второй – без этого оператора.

if (!(age >= 14 && age <= 90 )) {
  console.log(true)
}
if (age < 14 && age > 90 ) {
  console.log(true)
}



